Revit 2027 API
Document.NewSpace(Level, Phase, UV) Method
Creates a new space element on the given level, at the given location, and assigned to the given phase.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Space NewSpace(
	Level level,
	Phase phase,
	UV point
)
Public Function NewSpace (
	level As Level,
	phase As Phase,
	point As UV
) As Space
public:
Space^ NewSpace(
	Level^ level,
	Phase^ phase,
	UV^ point
)
member NewSpace :
        level : Level *
        phase : Phase *
        point : UV -> Space
Parameters
level Level
 The level on which the room is to exist.
phase Phase
 The phase in which the room is to exist.
point UV
 A 2D point that dictates the location on that specified level.
Return Value
Space
 If successful a new Space element within the project, otherwise null.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when level, phase or point is null.
InvalidOperationException |  Thrown when the space cannot be created.
ArgumentException | Thrown if the level does not exist in the given document.
ArgumentException | Thrown if the phase does not exist in the given document.
See Also
Reference
Document Class
NewSpace Overload
Autodesk.Revit.Creation Namespace